MatioRIGARD/PowerBatt/lib/inc/stm8l052_GPIO.h
#ifndef STM8L052_GPIO
#define STM8L052_GPIO

#include "stm8l15x.h"

typedef uint8_t STM8L052_GPIO_PINMODE;
typedef uint8_t STM8L052_GPIO_PINNUM;

#define STM8L052_GPIO_SET_DDR           1<<0
#define STM8L052_GPIO_SET_CR1           1<<1
#define STM8L052_GPIO_SET_CR2           1<<2

#define STM8L052_GPIO_OUTPUT_FLOAT      ((STM8L052_GPIO_PINMODE)STM8L052_GPIO_SET_DDR)
#define STM8L052_GPIO_OUTPUT_PP         ((STM8L052_GPIO_PINMODE)STM8L052_GPIO_SET_DDR|STM8L052_GPIO_SET_CR1)
#define STM8L052_GPIO_OUTPUT_SPD_2M     ((STM8L052_GPIO_PINMODE)STM8L052_GPIO_SET_DDR)
#define STM8L052_GPIO_OUTPUT_SPD_10M    ((STM8L052_GPIO_PINMODE)STM8L052_GPIO_SET_DDR|STM8L052_GPIO_SET_CR2)

#define STM8L052_GPIO_INPUT_OD          ((STM8L052_GPIO_PINMODE)0)
#define STM8L052_GPIO_INPUT_PUP         ((STM8L052_GPIO_PINMODE)STM8L052_GPIO_SET_CR1)
#define STM8L052_GPIO_INPUT_INT_DIS     ((STM8L052_GPIO_PINMODE)0)
#define STM8L052_GPIO_INPUT_INT_EN      ((STM8L052_GPIO_PINMODE)STM8L052_GPIO_SET_CR2)

#define STM8L052_GPIO_INPUT             ((STM8L052_GPIO_PINMODE)0)
#define STM8L052_GPIO_OUTPUT            ((STM8L052_GPIO_PINMODE)STM8L052_GPIO_SET_DDR)

#define PIN_0 ((STM8L052_GPIO_PINNUM)0)
#define PIN_1 ((STM8L052_GPIO_PINNUM)1)
#define PIN_2 ((STM8L052_GPIO_PINNUM)2)
#define PIN_3 ((STM8L052_GPIO_PINNUM)3)
#define PIN_4 ((STM8L052_GPIO_PINNUM)4)
#define PIN_5 ((STM8L052_GPIO_PINNUM)5)
#define PIN_6 ((STM8L052_GPIO_PINNUM)6)
#define PIN_7 ((STM8L052_GPIO_PINNUM)7)





void STM8L052_GPIO_SetupPin(GPIO_TypeDef* port, STM8L052_GPIO_PINNUM pin, STM8L052_GPIO_PINMODE pinmode);
void STM8L052_GPIO_High(GPIO_TypeDef* port, STM8L052_GPIO_PINNUM pin);
void STM8L052_GPIO_Low(GPIO_TypeDef* port, STM8L052_GPIO_PINNUM pin);
void STM8L052_GPIO_Toggle(GPIO_TypeDef* port, STM8L052_GPIO_PINNUM pin);

#endif // STM8L052_GPIO